In [1]:
#Ordenação de dados
import numpy as np
import pandas as pd

In [2]:
#Criando dataframe
dados = {
    'Nome':['Maria', 'Joao', 'Ana', 'Pedro'],
    'Idade':[25,32,28,40],
    'Salario':[5000,3000,4500,6000]
}
df = pd.DataFrame(dados)
df

    Nome  Idade  Salario
0  Maria     25     5000
1   Joao     32     3000
2    Ana     28     4500
3  Pedro     40     6000

In [3]:
#Metodo sort_values funciona para dataframe ou assets
df.sort_values('Idade') #Ordem ascendente

    Nome  Idade  Salario
0  Maria     25     5000
2    Ana     28     4500
1   Joao     32     3000
3  Pedro     40     6000

In [4]:
df.sort_values('Idade', ascending=False) #Ordem descendente

    Nome  Idade  Salario
3  Pedro     40     6000
1   Joao     32     3000
2    Ana     28     4500
0  Maria     25     5000

In [6]:
#Metodo sort_index 
df.sort_index()#Ascendente

    Nome  Idade  Salario
0  Maria     25     5000
1   Joao     32     3000
2    Ana     28     4500
3  Pedro     40     6000

In [12]:
df.sort_index(ascending=False) #Descendente

    Nome  Idade  Salario
3  Pedro     40     6000
2    Ana     28     4500
1   Joao     32     3000
0  Maria     25     5000

In [9]:
#Criação de uma Series
s= pd.Series([3,1,4,2], index=['b','d','a','c'])
s.head()

b    3
d    1
a    4
c    2
dtype: int64

In [10]:
#usando sort em series
s.sort_index() #Ascendente

a    4
b    3
c    2
d    1
dtype: int64

In [13]:
s.sort_index(ascending=False) #Descendente

d    1
c    2
b    3
a    4
dtype: int64